OpenNuvoton/M2351BSP/SampleCode/ISP/ISP_DFU/usbd_user.c
/**************************************************************************//**
 * @file     usbd_user.c
 * @version  V3.00
 * @brief    M2351 series USBD driver source file
 *
 * @copyright (C) 2019 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/

#include <string.h>
#include "NuMicro.h"

#ifdef __cplusplus
extern "C"
{
#endif

    /** @addtogroup Standard_Driver Standard Driver
      @{
    */

    /** @addtogroup USBD_Driver USBD Driver
      @{
    */


    /** @addtogroup USBD_EXPORTED_FUNCTIONS USBD Exported Functions
      @{
    */

    /* Global variables for Control Pipe */
    uint8_t g_USBD_au8SetupPacket[8] = {0UL};        /*!< Setup packet buffer */
    volatile uint8_t g_USBD_u8RemoteWakeupEn = 0UL; /*!< Remote wake up function enable flag */

    /**
     * @cond HIDDEN_SYMBOLS
     */
    static uint8_t *g_USBD_pu8CtrlInPointer = 0;
    static uint8_t *g_USBD_pu8CtrlOutPointer = 0;
    static volatile uint32_t g_USBD_u32CtrlInSize = 0UL;
    static volatile uint32_t g_USBD_u32CtrlOutSize = 0UL;
    static volatile uint32_t g_USBD_u32CtrlOutSizeLimit = 0UL;
    static volatile uint32_t g_USBD_u32UsbAddr = 0UL;
    static volatile uint32_t g_USBD_u32UsbConfig = 0UL;
    static volatile uint32_t g_USBD_u32CtrlMaxPktSize = 8UL;
    static volatile uint32_t g_USBD_u32CtrlOutToggle = 0;
    static volatile uint8_t  g_USBD_u8CtrlInZeroFlag = 0UL;
    /**
     * @endcond
     */

    const S_USBD_INFO_T *g_USBD_sInfo;                  /*!< A pointer for USB information structure */

    VENDOR_REQ g_USBD_pfnVendorRequest       = NULL;    /*!< USB Vendor Request Functional Pointer */
    CLASS_REQ g_USBD_pfnClassRequest         = NULL;    /*!< USB Class Request Functional Pointer */
    SET_INTERFACE_REQ g_USBD_pfnSetInterface = NULL;    /*!< USB Set Interface Functional Pointer */
    SET_CONFIG_CB g_USBD_pfnSetConfigCallback = NULL;   /*!< USB Set configuration callback function pointer */
    uint32_t g_USBD_u32EpStallLock           = 0UL;     /*!< Bit map flag to lock specified EP when SET_FEATURE */

    void USBD_GetDescriptor(void);

    /**
      * @brief      This function makes USBD module to be ready to use
      *
      * @param[in]  param           The structure of USBD information.
      * @param[in]  pfnClassReq     USB Class request callback function.
      * @param[in]  pfnSetInterface USB Set Interface request callback function.
      *
      * @return     None
      *
      * @details    This function will enable USB controller, USB PHY transceiver and pull-up resistor of USB_D+ pin. USB PHY will drive SE0 to bus.
      */
    void USBD_Open(const S_USBD_INFO_T *param, CLASS_REQ pfnClassReq, SET_INTERFACE_REQ pfnSetInterface)
    {
        g_USBD_sInfo = param;
        g_USBD_pfnClassRequest = pfnClassReq;
        g_USBD_pfnSetInterface = pfnSetInterface;

        /* get EP0 maximum packet size */
        g_USBD_u32CtrlMaxPktSize = g_USBD_sInfo->gu8DevDesc[7];

        /* Initial USB engine */
    #ifdef SUPPORT_LPM
        USBD->ATTR = 0x7D0UL | USBD_LPMACK;
    #else
        USBD->ATTR = 0x7D0UL;
    #endif
        /* Force SE0 */
        USBD_SET_SE0();
    }

    /**
      * @brief    This function makes USB host to recognize the device
      *
      * @param    None
      *
      * @return   None
      *
      * @details  Enable WAKEUP, FLDET, USB and BUS interrupts. Disable software-disconnect function after 100ms delay with SysTick timer.
      */
    void USBD_Start(void)
    {
        /* Disable software-disconnect function */
        USBD_CLR_SE0();

        /* Clear USB-related interrupts before enable interrupt */
        USBD_CLR_INT_FLAG(USBD_INT_BUS | USBD_INT_USB | USBD_INT_FLDET | USBD_INT_WAKEUP);

        /* Enable USB-related interrupts. */
        USBD_ENABLE_INT(USBD_INT_BUS | USBD_INT_USB | USBD_INT_FLDET | USBD_INT_WAKEUP);
    }

    /**
      * @brief      Get the received SETUP packet
      *
      * @param[in]  buf A buffer pointer used to store 8-byte SETUP packet.
      *
      * @return     None
      *
      * @details    Store SETUP packet to a user-specified buffer.
      *
      */
    void USBD_GetSetupPacket(uint8_t *buf)
    {
        USBD_MemCopy(buf, g_USBD_au8SetupPacket, 8UL);
    }

    /**
      * @brief    Process SETUP packet
      *
      * @param    None
      *
      * @return   None
      *
      * @details  Parse SETUP packet and perform the corresponding action.
      *
      */
    void USBD_ProcessSetupPacket(void)
    {
        g_USBD_u32CtrlOutToggle = 0;
        /* Get SETUP packet from USB buffer */
        USBD_MemCopy(g_USBD_au8SetupPacket, (uint8_t *)USBD_BUF_BASE, 8UL);

        /* Check the request type */
        switch(g_USBD_au8SetupPacket[0] & 0x60UL)
        {
            case REQ_STANDARD:   /* Standard */
            {
                USBD_StandardRequest();
                break;
            }
            case REQ_CLASS:   /* Class */
            {
                if(g_USBD_pfnClassRequest != NULL)
                {
                    g_USBD_pfnClassRequest();
                }
                break;
            }
#if 0
            case REQ_VENDOR:   /* Vendor */
            {
                if(g_USBD_pfnVendorRequest != NULL)
                {
                    g_USBD_pfnVendorRequest();
                }
                break;
            }
#endif
            default:   /* reserved */
            {
                /* Setup error, stall the device */
                USBD_SET_EP_STALL(EP0);
                USBD_SET_EP_STALL(EP1);
                break;
            }
        }
    }

    /**
      * @brief    Process GetDescriptor request
      *
      * @param    None
      *
      * @return   None
      *
      * @details  Parse GetDescriptor request and perform the corresponding action.
      *
      */
    void USBD_GetDescriptor(void)
    {
        uint32_t u32Len;

        g_USBD_u8CtrlInZeroFlag = (uint8_t)0UL;
        u32Len = 0UL;
        u32Len = g_USBD_au8SetupPacket[7];
        u32Len <<= 8UL;
        u32Len += g_USBD_au8SetupPacket[6];

        switch(g_USBD_au8SetupPacket[3])
        {
            /* Get Device Descriptor */
            case DESC_DEVICE:
            {
                u32Len = USBD_Minimum(u32Len, (uint32_t)LEN_DEVICE);
                USBD_PrepareCtrlIn((uint8_t *)g_USBD_sInfo->gu8DevDesc, u32Len);
                break;
            }
            /* Get Configuration Descriptor */
            case DESC_CONFIG:
            {
                uint32_t u32TotalLen;

                u32TotalLen = g_USBD_sInfo->gu8ConfigDesc[3];
                u32TotalLen = g_USBD_sInfo->gu8ConfigDesc[2] + (u32TotalLen << 8UL);

                if(u32Len > u32TotalLen)
                {
                    u32Len = u32TotalLen;
                    if((u32Len % g_USBD_u32CtrlMaxPktSize) == 0UL)
                    {
                        g_USBD_u8CtrlInZeroFlag = (uint8_t)1UL;
                    }
                }
                USBD_PrepareCtrlIn((uint8_t *)g_USBD_sInfo->gu8ConfigDesc, u32Len);
                break;
            }
#if 0
            /* Get BOS Descriptor */
            case DESC_BOS:
            {
                if(g_USBD_sInfo->gu8BosDesc == 0)
                {
                    USBD_SET_EP_STALL(EP0);
                    USBD_SET_EP_STALL(EP1);
                }
                else
                {
                    u32Len = USBD_Minimum(u32Len, LEN_BOS + LEN_BOSCAP);
                    USBD_PrepareCtrlIn((uint8_t *)g_USBD_sInfo->gu8BosDesc, u32Len);
                }
                break;
            }
            /* Get HID Descriptor */
            case DESC_HID:
            {
                /* CV3.0 HID Class Descriptor Test,
                   Need to indicate index of the HID Descriptor within gu8ConfigDescriptor, specifically HID Composite device. */
                uint32_t u32ConfigDescOffset;   /* u32ConfigDescOffset is configuration descriptor offset (HID descriptor start index) */
                u32Len = USBD_Minimum(u32Len, LEN_HID);
                u32ConfigDescOffset = g_USBD_sInfo->gu32ConfigHidDescIdx[g_USBD_au8SetupPacket[4]];
                USBD_PrepareCtrlIn((uint8_t *)&g_USBD_sInfo->gu8ConfigDesc[u32ConfigDescOffset], u32Len);
                break;
            }
            /* Get Report Descriptor */
            case DESC_HID_RPT:
            {
                if(u32Len > g_USBD_sInfo->gu32HidReportSize[g_USBD_au8SetupPacket[4]])
                {
                    u32Len = g_USBD_sInfo->gu32HidReportSize[g_USBD_au8SetupPacket[4]];
                    if((u32Len % g_USBD_u32CtrlMaxPktSize) == 0UL)
                    {
                        g_USBD_u8CtrlInZeroFlag = (uint8_t)1UL;
                    }
                }
                USBD_PrepareCtrlIn((uint8_t *)g_USBD_sInfo->gu8HidReportDesc[g_USBD_au8SetupPacket[4]], u32Len);
                break;
            }
#endif
            /* Get String Descriptor */
            case DESC_STRING:
            {
                /* Get String Descriptor */
                if(g_USBD_au8SetupPacket[2] < 4UL)
                {
                    if(u32Len > g_USBD_sInfo->gu8StringDesc[g_USBD_au8SetupPacket[2]][0])
                    {
                        u32Len = g_USBD_sInfo->gu8StringDesc[g_USBD_au8SetupPacket[2]][0];
                        if((u32Len % g_USBD_u32CtrlMaxPktSize) == 0UL)
                        {
                            g_USBD_u8CtrlInZeroFlag = (uint8_t)1UL;
                        }
                    }
                    USBD_PrepareCtrlIn((uint8_t *)g_USBD_sInfo->gu8StringDesc[g_USBD_au8SetupPacket[2]], u32Len);
                    break;
                }
                else
                {
                    /* Not support. Reply STALL. */
                    USBD_SET_EP_STALL(EP0);
                    USBD_SET_EP_STALL(EP1);
                    break;
                }
            }
            default:
                /* Not support. Reply STALL. */
                USBD_SET_EP_STALL(EP0);
                USBD_SET_EP_STALL(EP1);
                break;
        }
    }

    /**
      * @brief    Process standard request
      *
      * @param    None
      *
      * @return   None
      *
      * @details  Parse standard request and perform the corresponding action.
      *
      */
    void USBD_StandardRequest(void)
    {
#if 0
        uint32_t u32Addr;
#endif
        /* clear global variables for new request */
        g_USBD_pu8CtrlInPointer = 0;
        g_USBD_u32CtrlInSize = 0UL;

        if((g_USBD_au8SetupPacket[0] & 0x80UL) == 0x80UL)    /* request data transfer direction */
        {
            /* Device to host */
            switch(g_USBD_au8SetupPacket[1])
            {
#if 0
                case GET_CONFIGURATION:
                {
                    /* Return current configuration setting */
                    /* Data stage */
                    u32Addr = USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP0);
                    M8(u32Addr) = (uint8_t)g_USBD_u32UsbConfig;
                    USBD_SET_DATA1(EP0);
                    USBD_SET_PAYLOAD_LEN(EP0, 1UL);
                    /* Status stage */
                    USBD_PrepareCtrlOut(0, 0UL);
                    break;
                }
#endif
                case GET_DESCRIPTOR:
                {
                    USBD_GetDescriptor();
                    USBD_PrepareCtrlOut(0, 0UL); /* For status stage */
                    break;
                }
#if 0
                case GET_INTERFACE:
                {
                    /* Return current interface setting */
                    /* Data stage */
                    u32Addr = USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP0);
                    M8(u32Addr) = (uint8_t)g_USBD_u32UsbAltInterface;
                    USBD_SET_DATA1(EP0);
                    USBD_SET_PAYLOAD_LEN(EP0, 1UL);
                    /* Status stage */
                    USBD_PrepareCtrlOut(0, 0UL);
                    break;
                }
                case GET_STATUS:
                {
                    /* Device */
                    if(g_USBD_au8SetupPacket[0] == 0x80UL)
                    {
                        uint8_t u8Tmp;

                        u8Tmp = (uint8_t)0UL;
                        if((g_USBD_sInfo->gu8ConfigDesc[7] & 0x40UL) == 0x40UL)
                        {
                            u8Tmp |= (uint8_t)1UL; /* Self-Powered/Bus-Powered. */
                        }
                        if((g_USBD_sInfo->gu8ConfigDesc[7] & 0x20UL) == 0x20UL)
                        {
                            u8Tmp |= (uint8_t)(g_USBD_u8RemoteWakeupEn << 1UL); /* Remote wake up */
                        }

                        u32Addr = USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP0);
                        M8(u32Addr) = u8Tmp;

