OpenNuvoton/M2351BSP/SampleCode/ISP/ISP_DFU/usbd_user.c
                    }
                    /* Interface */
                    else if(g_USBD_au8SetupPacket[0] == 0x81UL)
                    {
                        u32Addr = USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP0);
                        M8(u32Addr) = (uint8_t)0UL;
                    }
                    /* Endpoint */
                    else if(g_USBD_au8SetupPacket[0] == 0x82UL)
                    {
                        uint8_t ep = (uint8_t)(g_USBD_au8SetupPacket[4] & 0xFUL);
                        u32Addr = USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP0);
                        M8(u32Addr) = (uint8_t)(USBD_GetStall(ep) ? 1UL : 0UL);
                    }

                    u32Addr = USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP0) + 1UL;
                    M8(u32Addr) = (uint8_t)0UL;
                    /* Data stage */
                    USBD_SET_DATA1(EP0);
                    USBD_SET_PAYLOAD_LEN(EP0, 2UL);
                    /* Status stage */
                    USBD_PrepareCtrlOut(0, 0UL);
                    break;
                }
#endif
                default:
                {
                    /* Setup error, stall the device */
                    USBD_SET_EP_STALL(EP0);
                    USBD_SET_EP_STALL(EP1);
                    break;
                }
            }
        }
        else
        {
            /* Host to device */
            switch(g_USBD_au8SetupPacket[1])
            {
                case CLEAR_FEATURE:
                {
                    if(g_USBD_au8SetupPacket[2] == FEATURE_ENDPOINT_HALT)
                    {
                        uint32_t epNum, i;

                        /* EP number stall is not allow to be clear in MSC class "Error Recovery Test".
                           a flag: g_USBD_u32EpStallLock is added to support it */
                        epNum = (uint8_t)(g_USBD_au8SetupPacket[4] & 0xFUL);
                        for(i = 0UL; i < USBD_MAX_EP; i++)
                        {
                            if(((USBD->EP[i].CFG & 0xFUL) == epNum) && ((g_USBD_u32EpStallLock & (1UL << i)) == 0UL))
                            {
                                USBD->EP[i].CFGP &= ~USBD_CFGP_SSTALL_Msk;
                                USBD->EP[i].CFG &= ~USBD_CFG_DSQSYNC_Msk;
                            }
                        }
                    }
                    else if(g_USBD_au8SetupPacket[2] == FEATURE_DEVICE_REMOTE_WAKEUP)
                    {
                        g_USBD_u8RemoteWakeupEn = (uint8_t)0UL;
                    }

                    /* Status stage */
                    USBD_SET_DATA1(EP0);
                    USBD_SET_PAYLOAD_LEN(EP0, 0UL);
                    break;
                }
                case SET_ADDRESS:
                {
                    g_USBD_u32UsbAddr = g_USBD_au8SetupPacket[2];

                    /* DATA IN for end of setup */
                    /* Status Stage */
                    USBD_SET_DATA1(EP0);
                    USBD_SET_PAYLOAD_LEN(EP0, 0UL);
                    break;
                }
                case SET_CONFIGURATION:
                {
                    g_USBD_u32UsbConfig = g_USBD_au8SetupPacket[2];

                    if(g_USBD_pfnSetConfigCallback)
                    {
                        g_USBD_pfnSetConfigCallback();
                    }

                    /* DATA IN for end of setup */
                    /* Status stage */
                    USBD_SET_DATA1(EP0);
                    USBD_SET_PAYLOAD_LEN(EP0, 0UL);
                    break;
                }
                case SET_FEATURE:
                {
#if 0
                    if((g_USBD_au8SetupPacket[0] & 0xFUL) == 0UL)   /* 0: device */
                    {
                        if((g_USBD_au8SetupPacket[2] == 3UL) && (g_USBD_au8SetupPacket[3] == 0UL)) /* 3: HNP enable */
                        {
                            OTG->CTL |= (OTG_CTL_HNPREQEN_Msk | OTG_CTL_BUSREQ_Msk);
                        }
                    }
#endif
                    if(g_USBD_au8SetupPacket[2] == FEATURE_ENDPOINT_HALT)
                    {
                        USBD_SetStall((uint8_t)(g_USBD_au8SetupPacket[4] & 0xFUL));
                    }
                    else if(g_USBD_au8SetupPacket[2] == FEATURE_DEVICE_REMOTE_WAKEUP)
                    {
                        g_USBD_u8RemoteWakeupEn = (uint8_t)1UL;
                    }

                    /* Status stage */
                    USBD_SET_DATA1(EP0);
                    USBD_SET_PAYLOAD_LEN(EP0, 0UL);
                    break;
                }
#if 0
                case SET_INTERFACE:
                {
                    g_USBD_u32UsbAltInterface = g_USBD_au8SetupPacket[2];
                    if(g_USBD_pfnSetInterface != NULL)
                    {
                        g_USBD_pfnSetInterface(g_USBD_u32UsbAltInterface);
                    }

                    /* Status stage */
                    USBD_SET_DATA1(EP0);
                    USBD_SET_PAYLOAD_LEN(EP0, 0UL);
                    break;
                }
#endif
                default:
                {
                    /* Setup error, stall the device */
                    USBD_SET_EP_STALL(EP0);
                    USBD_SET_EP_STALL(EP1);
                    break;
                }
            }
        }
    }

    /**
      * @brief      Prepare the first Control IN pipe
      *
      * @param[in]  pu8Buf  The pointer of data sent to USB host.
      * @param[in]  u32Size The IN transfer size.
      *
      * @return     None
      *
      * @details    Prepare data for Control IN transfer.
      *
      */
    void USBD_PrepareCtrlIn(uint8_t pu8Buf[], uint32_t u32Size)
    {
        uint32_t u32Addr;

        if(u32Size > g_USBD_u32CtrlMaxPktSize)
        {
            /* Data size > MXPLD */
            g_USBD_pu8CtrlInPointer = pu8Buf + g_USBD_u32CtrlMaxPktSize;
            g_USBD_u32CtrlInSize = u32Size - g_USBD_u32CtrlMaxPktSize;
            USBD_SET_DATA1(EP0);
            u32Addr = USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP0);
            USBD_MemCopy((uint8_t *)u32Addr, pu8Buf, g_USBD_u32CtrlMaxPktSize);
            USBD_SET_PAYLOAD_LEN(EP0, g_USBD_u32CtrlMaxPktSize);
        }
        else
        {
            /* Data size <= MXPLD */
            g_USBD_pu8CtrlInPointer = 0;
            g_USBD_u32CtrlInSize = 0UL;
            USBD_SET_DATA1(EP0);
            u32Addr = USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP0);
            USBD_MemCopy((uint8_t *)u32Addr, pu8Buf, u32Size);
            USBD_SET_PAYLOAD_LEN(EP0, u32Size);
        }
    }

    /**
      * @brief    Repeat Control IN pipe
      *
      * @param    None
      *
      * @return   None
      *
      * @details  This function processes the remained data of Control IN transfer.
      *
      */
    void USBD_CtrlIn(void)
    {
        uint32_t u32Addr;

