OpenNuvoton/M2351BSP/SampleCode/ISP/ISP_DFU/usbd_user.c
        if(g_USBD_u32CtrlInSize)
        {
            /* Process remained data */
            if(g_USBD_u32CtrlInSize > g_USBD_u32CtrlMaxPktSize)
            {
                /* Data size > MXPLD */
                u32Addr = USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP0);
                USBD_MemCopy((uint8_t *)u32Addr, (uint8_t *)g_USBD_pu8CtrlInPointer, g_USBD_u32CtrlMaxPktSize);
                USBD_SET_PAYLOAD_LEN(EP0, g_USBD_u32CtrlMaxPktSize);
                g_USBD_pu8CtrlInPointer += g_USBD_u32CtrlMaxPktSize;
                g_USBD_u32CtrlInSize -= g_USBD_u32CtrlMaxPktSize;
            }
            else
            {
                /* Data size <= MXPLD */
                u32Addr = USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP0);
                USBD_MemCopy((uint8_t *)u32Addr, (uint8_t *)g_USBD_pu8CtrlInPointer, g_USBD_u32CtrlInSize);
                USBD_SET_PAYLOAD_LEN(EP0, g_USBD_u32CtrlInSize);
                g_USBD_pu8CtrlInPointer = 0;
                g_USBD_u32CtrlInSize = 0UL;
            }
        }
        else /* No more data for IN token */
        {
            /* In ACK for Set address */
            if((g_USBD_au8SetupPacket[0] == REQ_STANDARD) && (g_USBD_au8SetupPacket[1] == SET_ADDRESS))
            {
                u32Addr = USBD_GET_ADDR();
                if((u32Addr != g_USBD_u32UsbAddr) && (u32Addr == 0UL))
                {
                    USBD_SET_ADDR(g_USBD_u32UsbAddr);
                }
            }

            /* For the case of data size is integral times maximum packet size */
            if(g_USBD_u8CtrlInZeroFlag)
            {
                USBD_SET_PAYLOAD_LEN(EP0, 0UL);
                g_USBD_u8CtrlInZeroFlag = (uint8_t)0UL;
            }
        }
    }

    /**
      * @brief      Prepare the first Control OUT pipe
      *
      * @param[in]  pu8Buf  The pointer of data received from USB host.
      * @param[in]  u32Size The OUT transfer size.
      *
      * @return     None
      *
      * @details    This function is used to prepare the first Control OUT transfer.
      *
      */
    void USBD_PrepareCtrlOut(uint8_t *pu8Buf, uint32_t u32Size)
    {
        g_USBD_pu8CtrlOutPointer = pu8Buf;
        g_USBD_u32CtrlOutSize = 0UL;
        g_USBD_u32CtrlOutSizeLimit = u32Size;
        USBD_SET_PAYLOAD_LEN(EP1, g_USBD_u32CtrlMaxPktSize);
    }

    /**
      * @brief    Repeat Control OUT pipe
      *
      * @param    None
      *
      * @return   None
      *
      * @details  This function processes the successive Control OUT transfer.
      *
      */
    void USBD_CtrlOut(void)
    {
        uint32_t u32Size;
        uint32_t u32Addr;

        if(g_USBD_u32CtrlOutToggle != (USBD->EPSTS0 & USBD_EPSTS0_EPSTS1_Msk))
        {
            g_USBD_u32CtrlOutToggle = USBD->EPSTS0 & USBD_EPSTS0_EPSTS1_Msk;
            if(g_USBD_u32CtrlOutSize < g_USBD_u32CtrlOutSizeLimit)
            {
                u32Size = USBD_GET_PAYLOAD_LEN(EP1);
                u32Addr = USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP1);
                USBD_MemCopy((uint8_t *)g_USBD_pu8CtrlOutPointer, (uint8_t *)u32Addr, u32Size);
                g_USBD_pu8CtrlOutPointer += u32Size;
                g_USBD_u32CtrlOutSize += u32Size;

                if(g_USBD_u32CtrlOutSize < g_USBD_u32CtrlOutSizeLimit)
                {
                    USBD_SET_PAYLOAD_LEN(EP1, g_USBD_u32CtrlMaxPktSize);
                }
            }
        }
        else
        {
            USBD_SET_PAYLOAD_LEN(EP1, g_USBD_u32CtrlMaxPktSize);
        }
    }

    /**
      * @brief    Reset software flags
      *
      * @param    None
      *
      * @return   None
      *
      * @details  This function resets all variables for protocol and resets USB device address to 0.
      *
      */
    void USBD_SwReset(void)
    {
        uint32_t i;

        /* Reset all variables for protocol */
        g_USBD_pu8CtrlInPointer = 0;
        g_USBD_u32CtrlInSize = 0UL;
        g_USBD_pu8CtrlOutPointer = 0;
        g_USBD_u32CtrlOutSize = 0UL;
        g_USBD_u32CtrlOutSizeLimit = 0UL;
        g_USBD_u32EpStallLock = 0UL;
        memset(g_USBD_au8SetupPacket, 0, 8UL);

        /* Reset PID DATA0 */
        for(i = 0UL; i < USBD_MAX_EP; i++)
        {
            USBD->EP[i].CFG &= ~USBD_CFG_DSQSYNC_Msk;
        }

        /* Reset USB device address */
        USBD_SET_ADDR(0UL);
    }

    /**
     * @brief       USBD Set Vendor Request
     *
     * @param[in]   pfnVendorReq    Vendor Request Callback Function
     *
     * @return      None
     *
     * @details     This function is used to set USBD vendor request callback function
     */
#if 0
    void USBD_SetVendorRequest(VENDOR_REQ pfnVendorReq)
    {
        g_USBD_pfnVendorRequest = pfnVendorReq;
    }
#endif

    /**
     * @brief       The callback function which called when get SET CONFIGURATION request
     *
     * @param[in]   pfnSetConfigCallback    Callback function pointer for SET CONFIGURATION request
     *
     * @return      None
     *
     * @details     This function is used to set the callback function which will be called at SET CONFIGURATION request.
     */
    void USBD_SetConfigCallback(SET_CONFIG_CB pfnSetConfigCallback)
    {
        g_USBD_pfnSetConfigCallback = pfnSetConfigCallback;
    }


    /**
     * @brief       EP stall lock function to avoid stall clear by USB SET FEATURE request.
     *
     * @param[in]   u32EpBitmap    Use bitmap to select which endpoints will be locked
     *
     * @return      None
     *
     * @details     This function is used to lock relative endpoint to avoid stall clear by SET FEATURE request.
     *              If ep stall locked, user needs to reset USB device or re-configure device to clear it.
     */
    void USBD_LockEpStall(uint32_t u32EpBitmap)
    {
        g_USBD_u32EpStallLock = u32EpBitmap;
    }

    /*@}*/ /* end of group USBD_EXPORTED_FUNCTIONS */

    /*@}*/ /* end of group USBD_Driver */

    /*@}*/ /* end of group Standard_Driver */

#ifdef __cplusplus
}
#endif

/*** (C) COPYRIGHT 2019 Nuvoton Technology Corp. ***/
